squre_cylinder_theta_45/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(    
    (0  0   0)//0
    (18  0  0) //1
    (20.5  0  0)//2
    (23  0  0)//3
    (60  0  0)//4
    (0  18  0)//5
    (18  18  0) //6
    (20.5  18  0)//7
    (23  18 0)//8
    (60  18  0)//9
    (0  20.5   0)//10
    (18  20.5  0) //11
    (19.79289  20.5  0)//12
    (20.5 19.79289  0)//13
    (21.207106 20.5  0)//14
    (23  20.5  0)//15
    (60  20.5  0)//16
    (0  23   0)//17
    (18  23  0) //18
    (20.5  23  0)//19
    (20.5 21.207106 0)//20
    (23  23 0)//21
    (60  23  0)//22
    (0  40   0)//23
    (18  40  0) //24
    (20.5 40  0)//25
    (23  40  0)//26
    (60  40  0)//27
    
	
    (0  0   0.1)//28
    (18  0  0.1) //29
    (20.5  0  0.1)//30
    (23  0  0.1)//31
    (60  0  0.1)//32
    (0  18  0.1)//33
    (18  18  0.1) //34
    (20.5  18  0.1)//35
    (23  18 0.1)//36
    (60  18  0.1)//37
    (0  20.5   0.1)//38
    (18  20.5  0.1) //39
    (19.79289  20.5  0.1)//40
    (20.5 19.79289  0.1)//41
    (21.207106 20.5  0.1)//42
    (23  20.5  0.1)//43
    (60  20.5  0.1)//44
    (0  23   0.1)//45
    (18  23  0.1) //46
    (20.5  23  0.1)//47
    (20.5 21.207106 0.1)//48
    (23  23  0.1)//49
    (60  23  0.1)//50
    (0  40   0.1)//51
    (18  40  0.1) //52
    (20.5 40  0.1)//53
    (23  40  0.1)//54
    (60  40  0.1)//55

    (20.14644 20.14644 0)//56
    (20.85355 20.14644 0)//57
    (20.14644 20.85355 0)//58
    (20.85355 20.85355 0)//59

    (20.14644 20.14644 0.1)//60
    (20.85355 20.14644 0.1)//61
    (20.14644 20.85355 0.1)//62
    (20.85355 20.85355 0.1)//63


);

blocks
(
    hex (1 6 5 0 29 34 33 28) (180 180 1) simpleGrading (-3 3 1)
    hex (2 7 6 1 30 35 34 29) (180 25 1)  simpleGrading (-3 1 1)
//  hex (3 9 8 2 39 45 44 38) (180 10 1) simpleGrading (-3 1 1)
    hex (3 8 7 2 31 36 35 30) (180 25 1) simpleGrading (-3 1 1)
    hex (4 9 8 3 32 37 36 31) (180 380 1) simpleGrading (-3 -3 1)

    hex (6 11 10 5 34 39 38 33) (25 180 1) simpleGrading (1 3 1)
    hex (7 13 56 6 35 41 60 34) (25 25 1) simpleGrading (1 1 1)
    hex (56 12 11 6 60 40 39 34) (25 25 1) simpleGrading (1 1 1)
    hex (8 15 14 57 36 43 42 61) (25 25 1) simpleGrading (1 1 1)
    hex (8 57 13 7 36 61 41 35) (25 25 1) simpleGrading (1 1 1)
    hex (9 16 15 8 37 44 43 36) (25 380 1) simpleGrading (1 -3 1)
/*   
    hex (13 19 18 12 49 55 54 48) (10 180 1) simpleGrading (1 3 1)
    hex (14 20 19 13 50 56 55 49) (10 20 1) simpleGrading (1 1 1)
    hex (16 22 21 15 52 58 57 51) (10 20 1) simpleGrading (1 1 1)
    hex (17 23 22 16 53 59 58 52) (10 370 1) simpleGrading (1 -3 1)
*/	
    hex (11 18 17 10 39 46 45 38) (25 180 1) simpleGrading (1 3 1)
    hex (12 58 18 11 40 62 46 39) (25 25 1) simpleGrading (1 1 1)
    hex (20 19 18 58 48 47 46 62)  (25 25 1) simpleGrading (1 1 1)
    hex (15 21 59 14 43 49 63 42) (25 25 1) simpleGrading (1 1 1)
    hex (59 21 19 20 63 49 47 48) (25 25 1) simpleGrading (1 1 1)
    hex (16 22 21 15 44 50 49 43) (25 380 1) simpleGrading (1 -3 1)

    hex (18 24 23 17 46 52 51 45) (180 180 1) simpleGrading (3 3 1)
    hex (19 25 24 18 47 53 52 46) (180 25 1)  simpleGrading (3 1 1)
//  hex (27 33 32 26 63 69 68 62) (180 10 1) simpleGrading (3 1 1)
    hex (21 26 25 19 49 54 53 47) (180 25 1) simpleGrading (3 1 1)
    hex (22 27 26 21 50 55 54 49) (180 380 1) simpleGrading (3 -3 1)

 

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
         (17 45 51 23)
	 (10 38 45 17)
	 (5 33 38 10)
	 (0 28 33 5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
	 (22 27 55 50)
	 (16 22 50 44)
	 (9  16 44 37)
	 (4  9 37 32)
        );
    }

    bottom
    {
        type symmetry;
        faces
        (
         (0 28 29 1)
	 (1 29 30 2)
	 (2 30 31 3)
	 (3 31 32 4)  
        );
    }

    top
    {
        type symmetry;
        faces
        (
         (23 51 52 24)
	 (24 52 53 25)
	 (25 53 54 26)
	 (26 54 55 27)
        );
    }

    cylinder
    {
       type wall;
       faces
       (
         (20 59 63 48)
         (59 14 42 63)
         (12 40 60 56)
         (56 60 41 13)
         (12 58 62 40)
         (58 20 48 62)
         (13 41 61 57)
         (57 61 42 14)
       );
    }

    frontAndBack
    {
        type empty;
        faces
        (
        (1 6 5 0)
        (29 34 33 28) 
        (2 7 6 1) 
	(30 35 34 29) 
        (3 8 7 2) 
	(31 36 35 30) 
        (4 9 8 3) 
	(32 37 36 31) 

        (6 11 10 5) 
	(34 39 38 33) 
        (7 13 56 6) 
	(35 41 60 34) 
        (56 12 11 6)
        (60 40 39 34) 
	(8 15 14 57)
        (36 43 42 61)
        (8 57 13 7)
        (36 61 41 35) 
        (9 16 15 8) 
	(37 44 43 36) 

        (11 18 17 10) 
	(39 46 45 38) 
        (12 58 18 11) 
	(40 62 46 39) 
        (20 19 18 58)
        (48 47 46 62) 
	(15 21 59 14)
        (43 49 63 42)
        (59 21 19 20)
        (63 49 47 48) 
        (16 22 21 15) 
	(44 50 49 43) 

        (18 24 23 17) 
	(46 52 51 45) 
        (19 25 24 18) 
	(47 53 52 46)
        (21 26 25 19) 
	(49 54 53 47) 
        (22 27 26 21) 
	(50 55 54 49) 
        );
    }
);


// ************************************************************************* //

